load/artillery-biodiv.yml
# Ouverture du catalogue biodiversité — AVANT / APRÈS, sur la même machine et le même run.
#
# Pourquoi ce fichier existe : les scénarios `artillery-light.yml`, `artillery.yml` et
# `artillery-10vu.yml` simulent l'ouverture du catalogue par **un seul `GET /api/plants`**.
# Ils mesuraient donc 1 requête là où le navigateur en émettait ~471
# (docs/AUDIT_CHARGE_BIODIVERSITE_2026-09.md, §1.2) — d'où des rapports verts sur un écran
# qui saturait le plafond de requêtes d'un établissement à trois ouvertures simultanées.
#
# Les deux scénarios ci-dessous rejouent la rafale RÉELLE, avant et après le correctif, pour
# que l'écart soit mesuré et non seulement compté :
#
#   - `catalogue_avant` : la grille montait toutes les fiches dépliées, et chacune allait
#     chercher ses données au montage → 1 + 3N requêtes (N = fiches affichées) ;
#   - `catalogue_apres` : la grille affiche des vignettes muettes ; seules la liste et la
#     fiche réellement ouverte coûtent quelque chose → 1 + 3 requêtes.
#
# Périmètre assumé : seules les routes PUBLIQUES sont rejouées. Le volet « commentaires de
# contexte » de la rafale historique (2 appels par fiche de plus, plus un
# `GET /api/settings/public`) demande un jeton et n'est pas simulé ici — le vrai écart est
# donc encore plus large que ce que ce fichier mesure.
#
# Usage :
#   npm run build && node server.js --foretmap-e2e-no-rate-limit   # dans un autre terminal
#   npx artillery run load/artillery-biodiv.yml --output load/report-biodiv.json
#
# `X-ForetMap-Load-Test` contourne le rate limit (cf. lib/rateLimit.js) : sans lui, le
# scénario « avant » se ferait couper par les 429 — ce qui est précisément le symptôme
# décrit par l'audit, mais empêcherait de mesurer les temps de réponse.

config:
  target: 'http://127.0.0.1:3000'
  processor: './biodiv-processor.js'
  http:
    timeout: 30
  defaults:
    headers:
      Accept: application/json
      X-ForetMap-Load-Test: '{{ $processEnvironment.LOAD_TEST_SECRET }}'
  phases:
    - duration: 20
      arrivalRate: 2
      name: warmup
    - duration: 60
      arrivalRate: 5
      name: plateau_classe
    - duration: 20
      arrivalRate: 2
      name: cool-down

scenarios:
  # ---------------------------------------------------------------------------------------
  # AVANT — une ouverture d'onglet = 1 + 3N requêtes.
  # 20 fiches seulement (et non 78) pour que le scénario reste jouable sur un poste de dev :
  # le rapport est donc une BORNE BASSE de ce que coûtait l'écran réel.
  # ---------------------------------------------------------------------------------------
  - name: catalogue_avant
    weight: 50
    flow:
      # Les identifiants viennent de la liste elle-même : le scénario reste juste quel que
      # soit le jeu de données (un `count` numérique tapait des fiches inexistantes).
      - get:
          url: /api/plants
          afterResponse: collectPlantIds
      - loop:
          - get:
              url: '/api/plants/{{ $loopElement }}/interactions'
          - get:
              url: '/api/plants/{{ $loopElement }}/glossary-terms'
          - get:
              url: '/api/plants/{{ $loopElement }}/quiz-questions'
        over: plantIds
      - think: 5

  # ---------------------------------------------------------------------------------------
  # APRÈS — la liste, puis la seule fiche que le lecteur ouvre vraiment.
  # ---------------------------------------------------------------------------------------
  - name: catalogue_apres
    weight: 50
    flow:
      - get:
          url: /api/plants
          afterResponse: collectPlantIds
      - think: 3
      - get:
          url: '/api/plants/{{ openedPlantId }}/interactions'
      - get:
          url: '/api/plants/{{ openedPlantId }}/glossary-terms'
      - get:
          url: '/api/plants/{{ openedPlantId }}/quiz-questions'
      - think: 5