load/artillery-light.yml
config:
  target: "http://127.0.0.1:3000"
  http:
    timeout: 20
  defaults:
    headers:
      Accept: application/json
      X-ForetMap-Load-Test: "{{ $processEnvironment.LOAD_TEST_SECRET }}"
  phases:
    - duration: 20
      arrivalRate: 2
      name: warmup
    - duration: 40
      arrivalRate: 2
      rampTo: 8
      name: ramp-up
    - duration: 90
      arrivalRate: 8
      name: plateau
    - duration: 30
      arrivalRate: 8
      rampTo: 3
      name: cool-down

scenarios:
  - name: lecture_legere
    weight: 50
    flow:
      - get:
          url: /api/health
      - think: 2
      - get:
          url: /api/version
      - think: 2
      - get:
          url: /api/health
      - think: 2

  - name: lecture_bdd
    weight: 35
    flow:
      - get:
          url: /api/health/db
      - think: 2
      - get:
          url: /api/zones
      - think: 2
      - get:
          url: /api/plants
      - think: 2

  - name: lecture_biodiversite
    weight: 15
    flow:
      - get:
          url: /api/plants
      - think: 2
      - get:
          url: /api/zones
      - think: 2